package com.payudon.command

import net.mamoe.mirai.event.events.MessageEvent

class RoleCommand: Command(
    "角色查询",
    "原神角色信息查询",
    mutableListOf(
        "^(#(角色|查询|查询角色|角色查询|人物)[ |0-9]*\$)|(^(#*uid|#*UID)\\+*[1|2|5-9][0-9]{8}\$)|(^#[\\+|＋]*[1|2|5-9][0-9]{8})",
        "^#角色详情[0-9]*\$",
        "^(#*角色3|#*角色卡片|角色)\$",
        "^#[上期|往期|本期]*(深渊|深境|深境螺旋)[上期|往期|本期]*[ |0-9]*\$",
        "^#*[上期|往期|本期]*(深渊|深境|深境螺旋)[上期|往期|本期]*[第]*(9|10|11|12|九|十|十一|十二)层[ |0-9]*\$",
        "^#[五星|四星|5星|4星]*武器[ |0-9]*\$",
        "^#(五星|四星|5星|4星|命座|角色|武器)[命座|角色|背包]*[信息|阵容]*[ |0-9]*\$",
        "^#*(我的)*(技能|天赋|武器|角色|练度|五|四|5|4|星)+(汇总|统计|列表)(force|五|四|5|4|星)*[ |0-9]*\$",
        "^#(角色2|宝箱|成就|尘歌壶|家园|探索|探险|声望|探险度|探索度)[ |0-9]*\$"
    ),
    null
){
    override suspend fun reply(msg: String, event: MessageEvent) {

    }
}